SecurityEvent
| where TimeGenerated > ago(1d)
| where EventID == 4732 // member added to security-enabled local group
| where TargetUserName =~ "Administrators" or TargetSid == "S-1-5-32-544"
| project TimeGenerated, Computer, AddedMember = MemberName, SubjectAccount, TargetUserName
